# CannotChangeUserSketchPlaneError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..CannotChangeUserSketchPlaneError Property
BuiltInFailures..::..SketchFailures Class See Also
---
Can't change plane of [Element Name] Sketch.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotChangeUserSketchPlaneError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotChangeUserSketchPlaneError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotChangeUserSketchPlaneError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace